[
  {
    "title": "AirBnB Clone",
    "description": "AirBNB Clone",
    "image": "/projectImages/airbnb.png",
    "image2": "/projectImages/airbnb_2.jpeg",
    "body": "This project is the first step towards building our first full web application: an AirBnB clone. This first step is very important because you will use what you build during this project with all other following projects: HTML/CSS templating, SQL, API, front-end integration…\nThe console is a command interpreter designed to manage the AirBnB objects of our project:\n• Create a new object (ex: a new User or a new Place)\n• Retrieve an object from a file, a database, etc.\n• Do operations on objects (count, compute stats, etc.)\n• Update attributes of an object\n• Destroy an object",
    "technologies": [
      "HTML",
      "CSS",
      "Python"
    ],
    "github": "https://github.com/Ferlandoo/holbertonschool-AirBnB_clone",
    "deployed": "#",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "To Do",
    "description": "To Do",
    "image": "/projectImages/todo.png",
    "image2": "/projectImages/storm.jpeg",
    "technologies": [
      "JavaScript",
      "jQuery",
      "HTML",
      "CSS"
    ],
    "body": "This mobile web application leverages the OpenWeatherMap API to deliver real-time weather data for any location. Users can view current conditions including temperature, humidity, and wind speed, as well as a 5-day forecast.\nThe interface automatically adapts between light and dark modes based on the time of day at the given location. Recent searches are stored to enable quick access to frequently checked cities. Geolocation functionality determines the user's position for quick access to local weather.\nBy combining a modern, responsive design with robust weather data pulled from OpenWeatherMap's API, this application aims to provide an intuitive experience for staying up-to-date on the latest weather conditions. The project demonstrates proficiency in integrating third-party APIs, building adaptive interfaces, and crafting performant mobile web applications.",
    "github": "#",
    "deployed": "#",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  }
]
